# IsValidHostId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..IsValidHostId Method
AreaLoad Class See Also
---
Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static bool IsValidHostId(
	Document pDoc,
	ElementId hostId
)
```

Visual Basic
---
```text
Public Shared Function IsValidHostId ( _
	pDoc As Document, _
	hostId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidHostId(
	Document^ pDoc,
	ElementId^ hostId
)
```

# ### Parameters
pDoc
    Type: Autodesk.Revit.DB..::..Document
hostId
    Type: Autodesk.Revit.DB..::..ElementId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace